# -*- coding: utf-8 -*-
"""
===================================
Project Euler Problem 38
===================================
192 に 1, 2, 3 を掛けてみよう.

192 × 1 = 192
192 × 2 = 384
192 × 3 = 576

積を連結することで1から9の パンデジタル数 192384576 が得られる.
 192384576 を 192 と (1,2,3) の連結積と呼ぶ.
同じようにして, 9 を 1,2,3,4,5 と掛け連結することで
パンデジタル数 918273645 が得られる. 
これは 9 と (1,2,3,4,5) との連結積である.
整数と (1,2,...,n) (n > 1) との連結積として得られる
9桁のパンデジタル数の中で最大のものはいくつか?
===================================

"""
def checkpan(a,b):
    c=a*array(b)
    d=map(str,c)
    e="".join(d)
    f=sorted(e)
    if f==['1', '2', '3', '4', '5', '6', '7', '8', '9']:
        return True,e
    return False,0
#print checkpan(192,[1,2,3])
#print checkpan(9,[1,2,3,4,5])
a="123456789"
ans=0
for n in range(2,10):
    b=map(int,a[:n])
    for m in range(1,10000):
        c,num=checkpan(m,b)        
        if c:
            if int(num)>ans:
                ans=int(num)
            print n,m,num,ans
print "max = ",ans
