# -*- coding: utf-8 -*-
"""
===================================
Project Euler Problem 40
===================================
正の整数を順に連結して得られる以下の10進の無理数を考える:

0.123456789101112131415161718192021...
小数第12位は1である.

dnで小数第n位の数を表す.
 d1 × d10 × d100 × d1000 × d10000 × d100000 × d1000000 を求めよ.

===================================
0.123456789101112131415161718192021...
はチャンパーノウン定数　十進正規数である

"""
n=1000000
i=1
a=''
while True:
    a=a+str(i)
    if len(a)>n:
#        print a
        break
    i+=1
ans=int(a[1-1])*int(a[10-1])*int(a[100-1])*int(a[1000-1])*\
    int(a[10000-1])*int(a[100000-1])*int(a[1000000-1])
print ans